# 2. По введенным пользователем координатам двух точек вывести уравнение прямой вида
# y = kx + b, проходящей через эти точки.

# Ввод данных для точек
x1 = int(input('Точка A \nВведите точку x1: '))
y1 = int(input('Введите точку y1: '))
print(f'A({x1}:{y1})')

x2 = int(input('Точка B \nВведите точку x2: '))
y2 = int(input('Введите точку y2: '))
print(f'B({x2}:{y2})')

if x1 == x2:
    print(f'x = {x1:.2f}')
else:
    # Вычисления
    k = (y1 - y2) / (x1 - x2)
    b = y2 - k * x2
    if b == 0:
        print(f'y = {k}x')
    elif b < 0:
        print(f'y = {k:.2f}x - {b * -1}')
    else:
        print(f'y = {k:.2f}x + {b:.2f}')